_posts/2014-11-30-package.html
---
title: "カスタマイズに使えるパッケージ"
date: 2015-03-28
layout: post
categories: package
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. TL;DR</a></li>
<li><a href="#sec-2">2. 推奨パッケージ</a>
<ul>
<li><a href="#sec-2-1">2.1. Better Defaults</a></li>
<li><a href="#sec-2-2">2.2. Starter-kit</a></li>
<li><a href="#sec-2-3">2.3. ido</a></li>
<li><a href="#sec-2-4">2.4. Smex</a></li>
<li><a href="#sec-2-5">2.5. helm/anything</a></li>
<li><a href="#sec-2-6">2.6. Web Browser</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1. eww(Emacs Web Wowser)</a></li>
<li><a href="#sec-2-6-2">2.6.2. w3m</a></li>
</ul>
</li>
<li><a href="#sec-2-7">2.7. 自動補完</a>
<ul>
<li><a href="#sec-2-7-1">2.7.1. Autocomplete</a></li>
<li><a href="#sec-2-7-2">2.7.2. Company</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> TL;DR</h2>
<div class="outline-text-2" id="text-1">
<p>
パッケージについて紹介していますが、めんどくさかったらquickstartを見
てスターターキットを入れましょう。大体の設定はしてくれますし、それ以
上の挙動はinit.elに追記すれば良いだけになります。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 推奨パッケージ</h2>
<div class="outline-text-2" id="text-2">
<p>
Emacsは環境であると言われるように、Emacsでは使うパッケージによっ
て使い勝手に差が出ます。 この記事ではEmacsで使うと良いであろうパッ
ケージについて紹介します。特に何も書いてない場合、MELPAからインストールできると思います。
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Better Defaults</h3>
<div class="outline-text-3" id="text-2-1">
<p>
一部の人にはおなじみのtechnomancy<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
という方が作っている、Emacsのデフォルトを少し改善するパッケージです。
内容としてはido, uniquify, saveplaceに対してのちょっとした設定、括弧の
対応の有効化、Menu-barなどの無効化が入っています。導入方法は以下の通りで
す
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">M-x package-install better-defaults
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Starter-kit</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Better Defaultsと同じ作者によるパッケージ、及びガイドです。推奨してお
きながら何ですが、パッケージ版がかなり古いため、試しに使ってみて、設定
を参考にするのに良いかと思って紹介しました。ガイドのほうは中々良いパッケー
ジをオススメして、一見の価値がありますので、是非参考にどうぞ。導入方法は
以下の通りです。
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">M-x package-install starter-kit
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> ido</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Ido(Interactively do)とはバッファやファイルやディレクトリなどを
選択する動作を、単語で絞り込んでいくように変更するEmacsのデフォルトパッケージ
です。\keys{C-s}と\keys{C-r}でカーソルの前後の移動で、
\keys{RET}で選択の決定です。
日本ではAnything/Helmが人気だと思われますが、海外のEmacsに関
する情報を見る限り、海外ではIdoの方が人気であるようです。
恐らくhelm/anythingを使わないというなら、まず使う事になると思われます。
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #029cdc; font-weight: bold;">require</span> '<span style="color: #035390;">ido</span>)
(setq ido-enable-flex-matching t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Smex</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Emacs使い初めだとまずコマンド覚えてないので標準のM-xは使いにくいです。
SmexはM-xをido-modeのようにするパッケージで、helm/anythingを使わないな
らまず使うと良いパッケージです。
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> helm/anything</h3>
<div class="outline-text-3" id="text-2-5">
<p>
[書く予定ですが、筆者は良く知らないので難航しています]
</p>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Web Browser</h3>
<div class="outline-text-3" id="text-2-6">
</div><div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> eww(Emacs Web Wowser)</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
現在のEmacsは標準でウェブブラウザを持っています。
GUI版Emacsを使っている場合は画像を表示できます。プログラミング中な
どにブラウザが横に表示されているというのは大変便利であるため、簡単な使い方
を書きたいと思います。
起動は以下のコマンドです。
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">M-x eww
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">キーバインド</th>
<th scope="col" class="left">機能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">DEL</td>
<td class="left">上にスクロール</td>
</tr>

<tr>
<td class="left">SPC</td>
<td class="left">下にスクロール</td>
</tr>

<tr>
<td class="left">&amp;</td>
<td class="left">外部のブラウザで現在のページを開く</td>
</tr>

<tr>
<td class="left">H</td>
<td class="left">履歴</td>
</tr>

<tr>
<td class="left">d</td>
<td class="left">ダウンロード</td>
</tr>

<tr>
<td class="left">b</td>
<td class="left">ブックマークに追加</td>
</tr>

<tr>
<td class="left">v</td>
<td class="left">開いているページのソースを表示</td>
</tr>

<tr>
<td class="left">w</td>
<td class="left">開いているページのURLをコピー</td>
</tr>

<tr>
<td class="left">q</td>
<td class="left">ewwを終了</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="section-number-4">2.6.2</span> w3m</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
w3m<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>はテキストブラウザとして有名なw3mをEmacsから使えるようにしたパッケージで
す。
ewwが出てくるまではEmacsでのブラウザというとこれくらいしかありませんで
した。注意点として、w3mが無いと動かないため、Windowsで使
おうとすると面倒な事になります。上述のewwはデフォルトでEmacsに入っているため、特別な
理由が無ければewwを使うと良いのではないでしょうか。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 自動補完</h3>
<div class="outline-text-3" id="text-2-7">
</div><div id="outline-container-sec-2-7-1" class="outline-4">
<h4 id="sec-2-7-1"><span class="section-number-4">2.7.1</span> Autocomplete</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
良く知られている、自動補完パッケージです。
そのうち書くので、今はこの辺りを読んでみてください
(<a href="http://cx4a.org/software/auto-complete/manual.ja.html">日本語マニュアル</a>)。
</p>
</div>
</div>

<div id="outline-container-sec-2-7-2" class="outline-4">
<h4 id="sec-2-7-2"><span class="section-number-4">2.7.2</span> Company</h4>
<div class="outline-text-4" id="text-2-7-2">
<p>
Autocompleteと同じような自動補完パッケージです。
Autocompleteよりも昔からあったので、古いパッケージではCompanyし
か対応していないものもあります
</p>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p><a href="https://github.com/technomancy">https://github.com/technomancy</a></p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p>同名なのでわかりにくいですが、パッケージ名です</p></div>


</div>
</div>
